<a href="https://colab.research.google.com/github/AndreMartins21/SISU-UFMG/blob/main/DFespec%C3%ADfico.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [50]:
import pandas as pd
import numpy as np

df = pd.read_excel("/content/drive/MyDrive/Colab Notebooks/DataSet Kaggle/DF_SISU_UFMG.xlsx")

df.head()

           Curso     Turno Modalidade  Mínimo  Máximo
0  ADMINISTRAÇÃO  Matutino        1.1  520.04  520.04
1  ADMINISTRAÇÃO  Matutino        1.2  642.08  674.66
2  ADMINISTRAÇÃO  Matutino        2.1  649.12  649.12
3  ADMINISTRAÇÃO  Matutino        2.2  698.38  719.48
4  ADMINISTRAÇÃO  Matutino        3.1  559.88  559.88

# **Organizando o dataframe**

## **# Funções que irão separar o MÁXIMO e MÍNIMO por modalidade**

In [51]:
modalidades = df["Modalidade"].unique()

def formatar_float(data_frame):
  data_frame["Nota"] = data_frame["Nota"].apply(lambda x: str(x).replace(".", ","))

  return data_frame["Nota"]

def curso_turno(data_frame):
  '''
  Função que mesclará o turno ao nome do curso. Ex: Medicina (Int) 
  '''

  cursos = data_frame["Curso"].values
  turnos = list([x[:3] for x in data_frame["Turno"].values])
  new_cursos = []

  for i, v in enumerate(cursos):
    v = f"{v} ({turnos[i]})"
    new_cursos.append(v)
  
  data_frame["Curso"] = new_cursos

  return data_frame["Curso"]


def criar_df(tipo="Máximo", ind=0):

  asc = False
  if tipo == "Mínimo":
    asc = True
  
  modal = modalidades[ind] # Var com a modalidade propriamente dita

  df_modal = df[df["Modalidade"] == modal]

  df_modal = df_modal.sort_values(tipo, ascending = asc, ignore_index = True).head()

  df_modal["Nota"] = df_modal[tipo].values

  # Trocando os valores de float (".") para (",")
  df_modal["Nota"] = formatar_float(df_modal)

  # Mesclando a sigla dos turnos aos seus respectivos turnos
  df_modal["Curso"] = curso_turno(df_modal)

  return df_modal[["Curso", "Nota", "Modalidade"]], modal

d, i = criar_df(ind= 7)

d

                            Curso    Nota         Modalidade
0     CIÊNCIA DA COMPUTAÇÃO (Mat)   845,0  Amplaconcorrência
1                  MEDICINA (Int)   836,5  Amplaconcorrência
2  MATEMÁTICA COMPUTACIONAL (Mat)   822,9  Amplaconcorrência
3       CIÊNCIAS ECONÔMICAS (Mat)  818,16  Amplaconcorrência
4       ENGENHARIA MECÂNICA (Not)   817,0  Amplaconcorrência

In [52]:
# Montando o dataframe completo com os 5 mínimos e máximos de cada modalidade

df_esp = pd.DataFrame()
m = 0

for tipo in ["Mínimo", "Máximo"]:
  
  for modal in range(0, len(modalidades)):

    dataf, m = criar_df(tipo, modal)

    df_esp = df_esp.append(dataf, ignore_index=True)

df_esp.head(7)

                                               Curso    Nota Modalidade
0                              BIBLIOTECONOMIA (Not)   398,7        1.1
1                                  AQUACULTURA (Mat)  434,74        1.1
2                                    GEOGRAFIA (Not)  439,42        1.1
3                     CONTROLADORIA E FINANÇAS (Mat)  441,06        1.1
4                          TERAPIA OCUPACIONAL (Mat)  460,08        1.1
5  CONSERVAÇÃO E RESTAURAÇÃO DE BENSCULTURAIS MÓV...  583,52        1.2
6                      ENGENHARIA DE ALIMENTOS (Mat)  589,68        1.2

In [53]:
# Passando para o Excel:

df_esp.to_excel("DataFrameEspecSISU.xlsx")